ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DA32def.inc
#define LOCKBITS_START 0x1040
#define LOCKBITS_SIZE 0x0004
#define LOCKBITS_END (0x1040 + 0x0004 - 1)
#define LOCKBITS_PAGE_SIZE 0x01

#define FUSES_START 0x1050
#define FUSES_SIZE 0x0010
#define FUSES_END (0x1050 + 0x0010 - 1)
#define FUSES_PAGE_SIZE 0x01

#define USER_SIGNATURES_START 0x1080
#define USER_SIGNATURES_SIZE 0x0020
#define USER_SIGNATURES_END (0x1080 + 0x0020 - 1)
#define USER_SIGNATURES_PAGE_SIZE 0x20

#define SIGNATURES_START 0x1100
#define SIGNATURES_SIZE 0x0003
#define SIGNATURES_END (0x1100 + 0x0003 - 1)
#define SIGNATURES_PAGE_SIZE 0x80

#define PROD_SIGNATURES_START 0x1103
#define PROD_SIGNATURES_SIZE 0x007D
#define PROD_SIGNATURES_END (0x1103 + 0x007D - 1)
#define PROD_SIGNATURES_PAGE_SIZE 0x80

#define EEPROM_START 0x1400
#define EEPROM_SIZE 0x0200
#define EEPROM_END (0x1400 + 0x0200 - 1)
#define EEPROM_PAGE_SIZE 0x01

#define INTERNAL_SRAM_START 0x6000
#define INTERNAL_SRAM_SIZE 0x2000
#define INTERNAL_SRAM_END (0x6000 + 0x2000 - 1)

#define MAPPED_PROGMEM_START 0x8000
#define MAPPED_PROGMEM_SIZE 0x8000
#define MAPPED_PROGMEM_END (0x8000 + 0x8000 - 1)
#define MAPPED_PROGMEM_PAGE_SIZE 0x200

#define PROGMEM_START 0x0000
#define PROGMEM_SIZE 0x10000
#define PROGMEM_END (0x0000 + 0x10000 - 1)
#define PROGMEM_PAGE_SIZE 0x200


; Legacy definitions
.equ    FLASHSTART    = (PROGMEM_START / 2) ; Note: Word address
.equ    FLASHEND      = (PROGMEM_END / 2) ; Note: Word address
.equ    IOEND         = IO_END
.equ    SRAM_START    = INTERNAL_SRAM_START
.equ    SRAM_SIZE     = INTERNAL_SRAM_SIZE
.equ    RAMEND        = INTERNAL_SRAM_END
.equ    E2END         = EEPROM_END
.equ    EEPROMEND     = EEPROM_END


; Definitions used by the assembler
#pragma AVRPART MEMORY PROG_FLASH 0x10000
#pragma AVRPART MEMORY EEPROM 0x0200
#pragma AVRPART MEMORY INT_SRAM SIZE 0x2000
#pragma AVRPART MEMORY INT_SRAM START_ADDR 0x6000

; ***** INTERRUPT VECTORS, ABSOLUTE ADDRESSES ****************************
; NMI interrupt vectors
.equ NMI_vect = 0x0002                   ; 

; BOD interrupt vectors
.equ BOD_VLM_vect = 0x0004               ; 

; RTC interrupt vectors
.equ RTC_CNT_vect = 0x0006               ; 
.equ RTC_PIT_vect = 0x0008               ; 

; CCL interrupt vectors
.equ CCL_CCL_vect = 0x000A               ; 

; PORTA interrupt vectors
.equ PORTA_PORT_vect = 0x000C            ; 

; TCA0 interrupt vectors
.equ TCA0_LUNF_vect = 0x000E             ; 
.equ TCA0_OVF_vect = 0x000E              ; 
.equ TCA0_HUNF_vect = 0x0010             ; 
.equ TCA0_CMP0_vect = 0x0012             ; 
.equ TCA0_LCMP0_vect = 0x0012            ; 
.equ TCA0_CMP1_vect = 0x0014             ; 
.equ TCA0_LCMP1_vect = 0x0014            ; 
.equ TCA0_CMP2_vect = 0x0016             ; 
.equ TCA0_LCMP2_vect = 0x0016            ; 

; TCB0 interrupt vectors
.equ TCB0_INT_vect = 0x0018              ; 

; TCB1 interrupt vectors
.equ TCB1_INT_vect = 0x001A              ; 

; TCD0 interrupt vectors
.equ TCD0_OVF_vect = 0x001C              ; 
.equ TCD0_TRIG_vect = 0x001E             ; 

; TWI0 interrupt vectors
.equ TWI0_TWIS_vect = 0x0020             ; 
.equ TWI0_TWIM_vect = 0x0022             ; 

; SPI0 interrupt vectors
.equ SPI0_INT_vect = 0x0024              ; 

; USART0 interrupt vectors
.equ USART0_RXC_vect = 0x0026            ; 
.equ USART0_DRE_vect = 0x0028            ; 
.equ USART0_TXC_vect = 0x002A            ; 

; PORTD interrupt vectors
.equ PORTD_PORT_vect = 0x002C            ; 

; AC0 interrupt vectors
.equ AC0_AC_vect = 0x002E                ; 

; ADC0 interrupt vectors
.equ ADC0_RESRDY_vect = 0x0030           ; 
.equ ADC0_WCMP_vect = 0x0032             ; 

; ZCD0 interrupt vectors
.equ ZCD0_ZCD_vect = 0x0034              ; 

; PTC interrupt vectors
.equ PTC_PTC_vect = 0x0036               ; 

; AC1 interrupt vectors
.equ AC1_AC_vect = 0x0038                ; 

; PORTC interrupt vectors
.equ PORTC_PORT_vect = 0x003A            ; 

; TCB2 interrupt vectors
.equ TCB2_INT_vect = 0x003C              ; 

; USART1 interrupt vectors
.equ USART1_RXC_vect = 0x003E            ; 
.equ USART1_DRE_vect = 0x0040            ; 
.equ USART1_TXC_vect = 0x0042            ; 

; PORTF interrupt vectors
.equ PORTF_PORT_vect = 0x0044            ; 

; NVMCTRL interrupt vectors
.equ NVMCTRL_EE_vect = 0x0046            ; 

; SPI1 interrupt vectors
.equ SPI1_INT_vect = 0x0048              ; 

; USART2 interrupt vectors
.equ USART2_RXC_vect = 0x004A            ; 
.equ USART2_DRE_vect = 0x004C            ; 
.equ USART2_TXC_vect = 0x004E            ; 

; AC2 interrupt vectors
.equ AC2_AC_vect = 0x0050                ; 

; TWI1 interrupt vectors
.equ TWI1_TWIS_vect = 0x0054             ; 
.equ TWI1_TWIM_vect = 0x0056             ; 



; ***** INTERRUPT VECTORS, MODULE BASES **********************************

.equ NMI_vbase = 0x0002
.equ BOD_vbase = 0x0004
.equ RTC_vbase = 0x0006
.equ CCL_vbase = 0x000A
.equ PORTA_vbase = 0x000C
.equ TCA0_vbase = 0x000E
.equ TCB0_vbase = 0x0018
.equ TCB1_vbase = 0x001A
.equ TCD0_vbase = 0x001C
.equ TWI0_vbase = 0x0020
.equ SPI0_vbase = 0x0024
.equ USART0_vbase = 0x0026
.equ PORTD_vbase = 0x002C
.equ AC0_vbase = 0x002E
.equ ADC0_vbase = 0x0030
.equ ZCD0_vbase = 0x0034
.equ PTC_vbase = 0x0036
.equ AC1_vbase = 0x0038
.equ PORTC_vbase = 0x003A
.equ TCB2_vbase = 0x003C
.equ USART1_vbase = 0x003E
.equ PORTF_vbase = 0x0044
.equ NVMCTRL_vbase = 0x0046
.equ SPI1_vbase = 0x0048
.equ USART2_vbase = 0x004A
.equ AC2_vbase = 0x0050
.equ TWI1_vbase = 0x0054


; ***** INTERRUPT VECTORS, VECTOR OFFSETS ********************************

; NMI interrupt vector offsets

.equ NMI_voffset = 0

; BOD interrupt vector offsets

.equ BOD_VLM_voffset = 0

; RTC interrupt vector offsets

.equ RTC_CNT_voffset = 0
.equ RTC_PIT_voffset = 2

; CCL interrupt vector offsets

.equ CCL_CCL_voffset = 0

; PORTA interrupt vector offsets

.equ PORTA_PORT_voffset = 0

; TCA0 interrupt vector offsets

.equ TCA0_LUNF_voffset = 0
.equ TCA0_OVF_voffset = 0
.equ TCA0_HUNF_voffset = 2
.equ TCA0_CMP0_voffset = 4
.equ TCA0_LCMP0_voffset = 4
.equ TCA0_CMP1_voffset = 6
.equ TCA0_LCMP1_voffset = 6
.equ TCA0_CMP2_voffset = 8
.equ TCA0_LCMP2_voffset = 8

